Repository: jdaibello/foodie-food-delivery-app
Catalog: lib/app/core/l10n/app_*.arb
Languages: pt

# skipBtnTxt
source: Skip
pt: Pular

# nextBtnTxt
source: Next
pt: Próximo

# splashTxtPartOne
source: Good Food Is What We
pt: Comida Boa É O Que

# splashTxtPartTwo
source: Deliver
pt: Entregamos

# getExploreBtnTxt
source: Get Explore!
pt: Vá Explorar!

# introOneTxtTitle
source: Order From Wide Range Restaurants
pt: Faça Pedidos Em Vários Restaurantes

# introOneTxtSubtitle
source: We provide services from wide range of 10,000+ restaurants.
pt: Nós fornecemos serviços de uma ampla variedade de mais de 10.000 restaurantes.

# introTwoTxtTitle
source: Find The Fastest Route To Your Doorstep
pt: Encontre A Rota Mais Rápida Até Sua Porta

# introTwoTxtSubtitle
source: We provide facility for quick delivery at your doorstep.
pt: Nós fornecemos facilidade para entrega rápida à sua porta.

# introThreeTxtTitle
source: The Fastest Food Delivery For You!
pt: O Delivery De Comida Mais Rápido Para Você!

# introThreeTxtSubtitle
source: Order now and get it within 30 minutes, or less.
pt: Peça agora e receba em 30 minutos ou menos.

# registerAuthTxt
source: Register
pt: Cadastro

# newUserQuestionTxt
source: New User?
pt: Novo Usuário?

# registerHereTxt
source: Register Here
pt: Cadastre-se Aqui

# accountAlreadyExistsQuestionTxt
source: Already Have An Account?
pt: Já Tem Uma Conta?

# loginHereTxt
source: Login Here
pt: Faça Login Aqui

# enterEmailTxt
source: Enter Email
pt: Digite o E-mail

# requiredEmailTxt
source: Required email
pt: E-mail obrigatório

# invalidEmailTxt
source: Invalid email
pt: E-mail inválido

# enterPasswordTxt
source: Enter Password
pt: Digite a Senha

# requiredPasswordTxt
source: Required password
pt: Senha obrigatória

# weakPasswordTxt
source: The password must contain at least 8 characters
pt: A senha deve conter pelo menos 8 caracteres

# forgotPasswordTxt
source: Forgot Password?
pt: Esqueceu a senha?

# privacyAndPoliceRegisterTxt
source: By clicking on Login you accept the privacy and policy terms.
pt: Ao clicar no login, você aceita os termos de privacidade e política.

# socialLoginTxt
source: OR, login with
pt: OU, faça login com

# enterNameTxt
source: Enter Name
pt: Digite o nome

# requiredNameTxt
source: Required name
pt: Nome obrigatório

# nameTooShortTxt
source: The name must contain at least 3 characters
pt: O nome deve conter pelo menos 3 caracteres

# enterUsernameTxt
source: Enter Username
pt: Digite o nome de usuário

# requiredUsernameTxt
source: Required username
pt: Nome de usuário obrigatório

# onlyCharactersUsernameTxt
source: Only characters are allowed
pt: Somente caracteres são permitidos

# usernameTooShortTxt
source: The username must contain at least 6 characters
pt: O nome de usuário deve conter pelo menos 6 caracteres

# enterPhoneNumberTxt
source: Enter Phone Number
pt: Digite o número de telefone

# requiredPhoneNumberTxt
source: Required phone number
pt: Número de telefone obrigatório

# phoneNumberTooShortTxt
source: The phone number must contain at least 11 digits
pt: O número de telefone deve conter pelo menos 11 dígitos

# phoneNumberTooLongTxt
source: The phone number must contain a maximum of 12 digits
pt: O número de telefone deve conter no máximo 12 dígitos

# enterConfirmPasswordTxt
source: Confirm Password
pt: Confirme a Senha

# requiredConfirmPasswordTxt
source: Required confirm password
pt: Confirme a senha obrigatório

# weakConfirmPasswordTxt
source: The confirm password must contain at least 8 characters
pt: Confirme a senha deve conter pelo menos 8 caracteres

# passwordAndConfirmPasswordNotEqualTxt
source: The password and confirm password must be equal
pt: A senha e a onfirme a senha devem ser iguais

# privacyAndPoliceLoginTxt
source: By clicking on Register you accept the privacy and policy terms.
pt: Ao clicar em Registrar você aceita os termos de política e privacidade.

# registerFormTxt
source: Register
pt: Cadastrar

# socialRegisterTxt
source: OR, register with
pt: OU, cadastre-se com
